CSI API ETABS v1

# cFunctionChangeName Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int ChangeName(
    	string Name,
    	string NewName
    )

    Function ChangeName (
    	Name As String,
    	NewName As String
    ) As Integer

    Dim instance As cFunction
    Dim Name As String
    Dim NewName As String
    Dim returnValue As Integer

    returnValue = instance.ChangeName(Name,
    	NewName)

    int ChangeName(
    	String^ Name,
    	String^ NewName
    )

    abstract ChangeName :
            Name : string *
            NewName : string -> int

#### Parameters

Name

    Type: SystemString

NewName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cFunction Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com